In [1]:
import pandas as pd

In [2]:
df_sp = pd.read_csv('../data/share_prices.csv')
df_sp.head()

  LOCATION INDICATOR SUBJECT  MEASURE FREQUENCY  TIME     Value Flag Codes
0      AUS   SHPRICE     TOT  IDX2015         A  1958  2.613002        NaN
1      AUS   SHPRICE     TOT  IDX2015         A  1959  3.256618        NaN
2      AUS   SHPRICE     TOT  IDX2015         A  1960  3.966841        NaN
3      AUS   SHPRICE     TOT  IDX2015         A  1961  3.653984        NaN
4      AUS   SHPRICE     TOT  IDX2015         A  1962  3.678260        NaN

In [3]:
print(df_sp.shape)

(35144, 8)

## Null Value Analysis

In [4]:
print("Analysis of Null values:")
df_sp.info()

Analysis of Null values:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35144 entries, 0 to 35143
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LOCATION    35144 non-null  object
 1   INDICATOR   35144 non-null  object
 2   SUBJECT     35144 non-null  object
 3   MEASURE     35144 non-null  object
 4   FREQUENCY   35144 non-null  object
 5   TIME        35144 non-null  object
 6   Value       35144 non-null  float64
 7   Flag Codes  25 non-null     object
dtypes: float64(1), object(7)
memory usage: 2.1+ MB

### Hence we see that there are only 25 non-null value in Flag Codes, hence we dropp it.

In [5]:
df_sp = df_sp.drop(columns=['Flag Codes'])
df_sp.head()

  LOCATION INDICATOR SUBJECT  MEASURE FREQUENCY  TIME     Value
0      AUS   SHPRICE     TOT  IDX2015         A  1958  2.613002
1      AUS   SHPRICE     TOT  IDX2015         A  1959  3.256618
2      AUS   SHPRICE     TOT  IDX2015         A  1960  3.966841
3      AUS   SHPRICE     TOT  IDX2015         A  1961  3.653984
4      AUS   SHPRICE     TOT  IDX2015         A  1962  3.678260

## Unique Value Analysis

In [6]:
df_sp.nunique()

LOCATION        46
INDICATOR        1
SUBJECT          1
MEASURE          1
FREQUENCY        3
TIME          1243
Value        33648
dtype: int64

### Here we see that INDICATOR, SUBJECT, MEASURE consists of only a single value within them, hence we can drp those columns.

In [7]:
df_sp = df_sp.drop(columns=["INDICATOR","SUBJECT","MEASURE"])
df_sp.head()

  LOCATION FREQUENCY  TIME     Value
0      AUS         A  1958  2.613002
1      AUS         A  1959  3.256618
2      AUS         A  1960  3.966841
3      AUS         A  1961  3.653984
4      AUS         A  1962  3.678260

In [8]:
df_sp.shape

(35144, 4)

## Datatype Reset

In [9]:
df_sp['LOCATION']=df_sp['LOCATION'].astype('string')
df_sp['TIME']=df_sp['TIME'].astype('string')

In [10]:
df_sp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35144 entries, 0 to 35143
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   LOCATION   35144 non-null  string
 1   FREQUENCY  35144 non-null  object
 2   TIME       35144 non-null  string
 3   Value      35144 non-null  float64
dtypes: float64(1), object(1), string(2)
memory usage: 1.1+ MB

## FREQUENCY Analysis

In [11]:
df_sp['FREQUENCY'].unique()

array(['A', 'Q', 'M'], dtype=object)

We need to analyse the FREQUENCY column to see if all countries have data consistent in the annual "A" format. We first need to set a range of which we will check the dates for

In [12]:
start_year = int(min(df_sp["TIME"]))
end_year = int(max(df_sp.loc[df_sp["FREQUENCY"] == "A"]["TIME"]))
print("Start Year",start_year)
print("End Year",end_year)

Start Year 1950
End Year 2022

Now we will set the start year to 2001 since we want roughly 15 years worth data.

In [13]:
start_year = 2001
countries = []
print("Missing Values:\n")
for c in df_sp["LOCATION"].unique():
    temp = df_sp.loc[df_sp["LOCATION"] == c]
    temp = temp[temp["FREQUENCY"] == "A"]["TIME"]
    for i in range(start_year,end_year+1):
        if(str(i) not in temp.values):
            print("Location:",c,"\tYear:",i)
            if c not in countries:
                countries.append(c)
print("\nCountries with missing values between 2001 and 2022:",len(countries))

Missing Values:


Countries with missing values between 2001 and 2022: 0

## Hence since the country has all the data from